{
  "_name_or_path": "distilbert/distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {"0": "B-DebtInstrumentBasisSpreadOnVariableRate1", "1": "B-DebtInstrumentFaceAmount", "2": "B-DebtInstrumentInterestRateStatedPercentage", "3": "B-DebtInstrumentMaturityDate", "4": "B-LineOfCreditFacilityMaximumBorrowingCapacity", "5": "I-DebtInstrumentBasisSpreadOnVariableRate1", "6": "I-DebtInstrumentFaceAmount", "7": "I-DebtInstrumentInterestRateStatedPercentage", "8": "I-DebtInstrumentMaturityDate", "9": "I-LineOfCreditFacilityMaximumBorrowingCapacity", "10": "O", "11": "PAD"},
  "initializer_range": 0.02,
  "label2id": {
  "B-DebtInstrumentBasisSpreadOnVariableRate1": 0,
  "B-DebtInstrumentFaceAmount": 1,
  "B-DebtInstrumentInterestRateStatedPercentage": 2,
  "B-DebtInstrumentMaturityDate": 3,
  "B-LineOfCreditFacilityMaximumBorrowingCapacity": 4,
  "I-DebtInstrumentBasisSpreadOnVariableRate1": 5,
  "I-DebtInstrumentFaceAmount": 6,
  "I-DebtInstrumentInterestRateStatedPercentage": 7,
  "I-DebtInstrumentMaturityDate": 8,
  "I-LineOfCreditFacilityMaximumBorrowingCapacity": 9,
  "O": 10,
  "PAD": 11
},
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.38.2",
  "vocab_size": 30522
}
